#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
google_project_service.services["iam.googleapis.com"]: Refreshing state... [id=baynext-x1307/iam.googleapis.com]
google_project_service.services["run.googleapis.com"]: Refreshing state... [id=baynext-x1307/run.googleapis.com]
google_project_service.services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=baynext-x1307/cloudresourcemanager.googleapis.com]
google_project_service.services["artifactregistry.googleapis.com"]: Refreshing state... [id=baynext-x1307/artifactregistry.googleapis.com]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/baynext-x1307/locations/europe-west1/repositories/baynext-docker-repo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_v2_job.baynext_ml_job will be created
  + resource "google_cloud_run_v2_job" "baynext_ml_job" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + deletion_protection      = true
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "europe-west1"
      + name                     = "baynext-ml-job"
      + observed_generation      = (known after apply)
      + project                  = "baynext-x1307"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 3
              + service_account       = (known after apply)
              + timeout               = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/placeholder"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloud_run = {
      + annotations              = null
      + binary_authorization     = []
      + client                   = null
      + client_version           = null
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + deletion_protection      = true
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + goog-terraform-provisioned = "true"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + labels                   = null
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "europe-west1"
      + name                     = "baynext-ml-job"
      + observed_generation      = (known after apply)
      + project                  = "baynext-x1307"
      + reconciling              = (known after apply)
      + template                 = [
          + {
              + annotations = null
              + labels      = null
              + parallelism = (known after apply)
              + task_count  = (known after apply)
              + template    = [
                  + {
                      + containers            = [
                          + {
                              + args          = null
                              + command       = null
                              + depends_on    = null
                              + env           = []
                              + image         = "us-docker.pkg.dev/cloudrun/container/placeholder"
                              + name          = null
                              + ports         = []
                              + resources     = (known after apply)
                              + startup_probe = (known after apply)
                              + volume_mounts = []
                              + working_dir   = null
                            },
                        ]
                      + encryption_key        = null
                      + execution_environment = (known after apply)
                      + max_retries           = 3
                      + service_account       = (known after apply)
                      + timeout               = (known after apply)
                      + volumes               = []
                      + vpc_access            = []
                    },
                ]
            },
        ]
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + goog-terraform-provisioned = "true"
        }
      + timeouts                 = null
      + uid                      = (known after apply)
      + update_time              = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @lgrosjean, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*